[
  {
    "title": "Senior Backend әзірлеуші (Python/Django)",
    "description": "Біздің компания тәжірибелі Python/Django әзірлеушіні іздеп жатыр. Сіз біздің негізгі өнімдеріміздің архитектурасын жобалауға және дамытуға жауапты боласыз. Команда жаңа мүмкіндіктерді жасауға және қолданыстағы жүйелерді оңтайландыруға жұмыс істейді.",
    "requirements": "Python, Django және DRF-мен кемінде 4 жыл жұмыс тәжірибесі. SQL/NoSQL деректер қорларымен жұмыс тәжірибесі. CI/CD құралдарын білу. Масштабталатын жүйелерді құру тәжірибесі. Микросервистік архитектураны түсіну.",
    "salary": "850,000 - 1,200,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Python", "Django", "Docker", "PostgreSQL", "Redis", "AWS"]
  },
  {
    "title": "UI/UX дизайнері",
    "description": "Біз қолданушы интерфейстерін жобалайтын шығармашылық дизайнерді іздейміз. Сіз пайдаланушы тәжірибесін жақсарту, пайдаланушы интерфейс прототиптерін жасау және брендтік бірегейлікті қолдау үшін жұмыс істейтін боласыз.",
    "requirements": "UI/UX дизайн саласында кемінде 3 жыл тәжірибе. Figma, Sketch және Adobe Creative Suite-ті меңгеру. Заманауи дизайн трендтерін білу. Пайдаланушы зерттеулерін жүргізу қабілеті. Мықты портфолио.",
    "salary": "700,000 - 950,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Figma", "Sketch", "Adobe XD", "UI Design", "UX Research"]
  },
  {
    "title": "DevOps инженері",
    "description": "Біз инфрақұрылымды басқару және жүйелерді автоматтандыру үшін тәжірибелі DevOps инженерін іздейміз. Сіз біздің CI/CD құбырларымызды құру және күтім жасау, бұлтты инфрақұрылымды басқару және масштабты өндірістік жүйелерді қамтамасыз ету сияқты міндеттерді атқаратын боласыз.",
    "requirements": "Linux/Unix жүйелерін басқаруда кемінде 3 жыл тәжірибе. Docker және Kubernetes тәжірибесі. CI/CD құралдарын білу (Jenkins, GitLab CI). Terraform немесе басқа IaC құралдарымен тәжірибе. AWS/GCP/Azure бұлтты платформаларымен жұмыс тәжірибесі.",
    "salary": "900,000 - 1,300,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["Docker", "Kubernetes", "AWS", "Terraform", "CI/CD", "Linux"]
  },
  {
    "title": "Data Scientist",
    "description": "Біздің компанияға деректерді талдау, модельдеу және машиналық оқыту алгоритмдерін әзірлеу үшін Data Scientist қажет. Сіз бизнес мақсаттарға жету үшін деректерден құнды түсініктер алып, болжамдық модельдер құрып, осы қорытындыларды бизнес мүдделі тараптарға жеткізетін боласыз.",
    "requirements": "Деректерді талдау және машиналық оқыту саласында кемінде 3 жыл тәжірибе. Python және машиналық оқыту кітапханаларын (TensorFlow, PyTorch, scikit-learn) білу. SQL және деректер базасын модельдеу тәжірибесі. Статистика және математика туралы терең білім. Деректерді визуализациялау дағдылары.",
    "salary": "800,000 - 1,150,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Python", "Machine Learning", "SQL", "Statistics", "Data Visualization"]
  },
  {
    "title": "Мобильді әзірлеуші (Flutter)",
    "description": "Біз Flutter көмегімен iOS және Android платформаларына арналған жоғары сапалы мобильді қолданбалар жасайтын Flutter әзірлеушіні іздейміз. Сіздің міндеттеріңізге қолданба архитектурасын жобалау, пайдаланушы интерфейсін құру және тиімді код жазу кіреді.",
    "requirements": "Flutter әзірлеуде кемінде 2 жыл тәжірибе. Dart тілін жақсы білу. iOS және Android платформаларын түсіну. REST API-мен жұмыс істеу тәжірибесі. Мобильді қолданбаларды жариялау тәжірибесі. Команданың бір бөлігі ретінде жұмыс істей білу.",
    "salary": "750,000 - 1,000,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Flutter", "Dart", "iOS", "Android", "REST API"]
  },
  {
    "title": "Full-Stack әзірлеуші (JavaScript)",
    "description": "Біздің компания клиенттік және серверлік қолданбаларды әзірлеуге тәжірибелі Full-Stack әзірлеушіні іздейді. Сіз заманауи фронтенд фреймворктерімен және бэкенд технологияларымен жұмыс істейтін боласыз.",
    "requirements": "JavaScript/TypeScript-те кемінде 3 жыл әзірлеу тәжірибесі. React, Angular немесе Vue.js тәжірибесі. Node.js, Express сияқты серверлік технологияларды білу. SQL және NoSQL деректер қорларымен жұмыс тәжірибесі. RESTful API және GraphQL білімі. Git және бағдарламалық жасақтама әзірлеу өмірлік циклін түсіну.",
    "salary": "800,000 - 1,100,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["JavaScript", "TypeScript", "React", "Node.js", "MongoDB", "GraphQL"]
  },
  {
    "title": "Киберқауіпсіздік маманы",
    "description": "Біздің компанияға ақпараттық қауіпсіздік жүйелерін жобалау, енгізу және мониторинг жүргізу үшін киберқауіпсіздік маманы қажет. Сіз қауіпсіздік стратегиясын әзірлеу, осалдықтарды анықтау және қауіпсіздікті бұзуға тұрақтылықты қамтамасыз ету үшін жұмыс істейтін боласыз.",
    "requirements": "Ақпараттық қауіпсіздік саласында кемінде 4 жыл тәжірибе. CEH, CISSP немесе баламалы сертификаттардың болуы. Желілік қауіпсіздік, деректерді шифрлау және қауіпсіздік хаттамаларын түсіну. Осалдықтарды тексеру және тесту жүргізу тәжірибесі. SIEM жүйелерімен жұмыс істеу тәжірибесі. Киберқауіпсіздік оқиғаларына жауап беру дағдылары.",
    "salary": "950,000 - 1,400,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Network Security", "Penetration Testing", "Encryption", "SIEM", "Incident Response"]
  },
  {
    "title": "Product Manager",
    "description": "Біз технологиялық өнімдерді басқаратын тәжірибелі Product Manager іздейміз. Сіздің міндеттеріңізге өнім стратегиясын анықтау, жол картасын әзірлеу, мүдделі тараптармен қарым-қатынас жасау және нарық талаптарын бағалау кіреді.",
    "requirements": "IT салада өнімді басқаруда кемінде 3 жыл тәжірибе. Agile әдіснамаларын (Scrum, Kanban) терең түсіну. Пайдаланушы зерттеулерін жүргізу және талаптарды жинау қабілеті. Техникалық және бизнес-командалармен жақсы қарым-қатынас. Деректерге негізделген шешімдер қабылдау дағдылары.",
    "salary": "900,000 - 1,300,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["Product Management", "Agile", "User Research", "Data Analysis", "Roadmapping"]
  },
  {
    "title": "Маркетинг менеджері",
    "description": "Біз компанияның маркетингтік стратегиясын әзірлеу және іске асыру үшін тәжірибелі маркетинг менеджерін іздейміз. Сіз сандық маркетинг науқандарын басқарып, бренд хабарламасын әзірлеп, маркетингтік метрикаларды талдайтын боласыз.",
    "requirements": "Маркетинг саласында кемінде 4 жыл жұмыс тәжірибесі. Сандық маркетинг арналарын (SEO, SEM, әлеуметтік медиа) терең түсіну. Google Analytics, Facebook Insights сияқты аналитикалық құралдармен жұмыс тәжірибесі. Мазмұн стратегиясын әзірлеу және іске асыру қабілеті. Жобаларды басқару дағдылары.",
    "salary": "650,000 - 900,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Digital Marketing", "Content Strategy", "SEO", "Social Media", "Google Analytics"]
  },
  {
    "title": "Қаржы менеджері",
    "description": "Біздің компанияға қаржылық жоспарлау, бюджеттеу және есеп беру процестерін басқару үшін тәжірибелі қаржы менеджері қажет. Сіз қаржы стратегиясын әзірлеп, қаржылық тәуекелдерді бағалап, бизнес шешімдеріне қаржылық сараптама жасайтын боласыз.",
    "requirements": "Қаржы саласында кемінде 5 жыл жұмыс тәжірибесі. Бухгалтерлік есеп және қаржылық талдау саласында терең білім. Бюджеттеу және болжау тәжірибесі. MS Excel-де жетік білу. Қаржылық есептерді дайындау және ұсыну қабілеті. CFA немесе MBA дәрежесінің болуы артықшылық.",
    "salary": "800,000 - 1,200,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["Financial Analysis", "Budgeting", "Forecasting", "Excel", "Financial Reporting"]
  },
  {
    "title": "HR менеджері",
    "description": "Біз персоналды басқару функциясын жетілдіретін және кадрларды тарту, дамыту және ұстау стратегиясын әзірлейтін тәжірибелі HR менеджерін іздейміз. Сіз қызметкерлерді іздеу, оқыту және дамыту бағдарламаларын, сондай-ақ корпоративтік мәдениетті дамытуды басқаратын боласыз.",
    "requirements": "HR саласында кемінде 4 жыл жұмыс тәжірибесі. Персоналды іріктеу, бағалау және дамыту саласында тәжірибе. Еңбек заңнамасын білу. Ұйымдастырушылық дамуды түсіну. HR метрикаларын талдау тәжірибесі. Жақсы коммуникативтік дағдылар.",
    "salary": "700,000 - 950,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Recruitment", "Performance Management", "Employee Relations", "Training", "HR Metrics"]
  },
  {
    "title": "QA инженері",
    "description": "Біз бағдарламалық өнімдердің сапасын қамтамасыз ету үшін тәжірибелі QA инженерін іздейміз. Сіз тестілеу стратегиясын әзірлеп, автоматтандырылған және қолмен тестілеу жүргізіп, бағдарламалық жасақтама жеткізу сапасын арттыратын боласыз.",
    "requirements": "Бағдарламалық жасақтаманы тексеруде кемінде 3 жыл тәжірибе. Тестілеуді автоматтандыру құралдарымен (Selenium, Cypress, JUnit) тәжірибе. API тестілеу тәжірибесі. Ақауларды басқару жүйелерімен жұмыс істеу тәжірибесі (Jira). Agile ортада жұмыс істеу тәжірибесі.",
    "salary": "700,000 - 950,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["Test Automation", "Manual Testing", "API Testing", "JIRA", "Selenium"]
  },
  {
    "title": "Бизнес-аналитик",
    "description": "Біз бизнес процестерді талдау және жақсарту үшін тәжірибелі бизнес-аналитикті іздейміз. Сіз мүдделі тараптармен жұмыс істеп, бизнес талаптарын жинап, функционалдық ерекшеліктерді жасап, жобаның іске асырылуына қолдау көрсететін боласыз.",
    "requirements": "Бизнес талдау саласында кемінде 3 жыл тәжірибе. Талаптарды жинау және құжаттау тәжірибесі. UML, BPMN сияқты модельдеу құралдарын білу. SQL және деректерді талдау дағдылары. Agile жобаларында жұмыс істеу тәжірибесі. Жақсы презентациялау және қарым-қатынас жасау дағдылары.",
    "salary": "750,000 - 1,050,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Requirements Analysis", "UML", "SQL", "Business Process Modeling", "Agile"]
  },
  {
    "title": "Логистика менеджері",
    "description": "Біздің компанияға жеткізу тізбегін басқару, көлік логистикасын ұйымдастыру және қоймалық операцияларды жетілдіру үшін тәжірибелі логистика менеджері қажет. Сіз логистикалық процестерді оңтайландырып, жеткізушілермен қарым-қатынасты басқарып, жеткізу уақытын азайтуға жұмыс істейтін боласыз.",
    "requirements": "Логистика немесе жеткізу тізбегін басқару саласында кемінде 4 жыл тәжірибе. Көлік және қойма логистикасын білу. Жеткізушілермен келіссөздер жүргізу тәжірибесі. Логистикалық шығындарды оңтайландыру тәжірибесі. Логистикалық бағдарламалық жасақтамамен жұмыс істеу дағдылары. MS Excel-де жетік білу.",
    "salary": "650,000 - 850,000 ₸",
    "location": "Астана",
    "job_type": "full-time",
    "skills": ["Supply Chain", "Transportation", "Warehousing", "Inventory Management", "Procurement"]
  },
  {
    "title": "Медициналық өкіл",
    "description": "Фармацевтикалық компания Алматы қаласында өз өнімдерін ілгерілету үшін медициналық өкіл іздейді. Сіз дәрігерлермен және медициналық мекемелермен өзара әрекеттесіп, компанияның өнімдері туралы ақпараттандырып, сату нәтижелерін жақсартатын боласыз.",
    "requirements": "Фармацевтикалық немесе медициналық сату саласында кемінде 2 жыл тәжірибе. Медициналық/фармацевтикалық білім. Медициналық терминологияны білу. Презентациялау және келіссөздер жүргізу дағдылары. Тиімді уақыт басқару дағдылары. B санатты жүргізуші куәлігі.",
    "salary": "600,000 - 800,000 ₸",
    "location": "Алматы",
    "job_type": "full-time",
    "skills": ["Medical Sales", "CRM", "Presentation Skills", "Client Relationship", "Product Knowledge"]
  }
] 